app/views/beers/show.html.erb

<p>
  <% if @beer.ratings.empty? %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
SELECT  1 AS one FROM "ratings" WHERE "ratings"."beer_id" = ? LIMIT ?  [["beer_id", 1], ["LIMIT", 1]]

  <% else %>
    Total of <%= pluralize(@beer.ratings.count, 'rating') %>, with an average of <%= round(@beer.average_rating) %>.
  <% end %>
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]