app/controllers/beers_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def set_breweries_and_styles_for_template
    @breweries = Brewery.all

INSERT INTO "beers" ("name", "style", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Olvin Paras"], ["style", "Lager"], ["brewery_id", 2], ["created_at", "2018-09-11 18:23:54.316650"], ["updated_at", "2018-09-11 18:23:54.316650"]]
---
  def create
    @beer = Beer.new(beer_params)
    respond_to do |format|
      if @beer.save