app/controllers/breweries_controller.rb

INSERT INTO "breweries" ("name", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kova"], ["year", 2], ["created_at", "2018-09-08 09:54:25.861885"], ["updated_at", "2018-09-08 09:54:25.861885"]]
---
  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def toggle_activity
    brewery = Brewery.find(params[:id])