app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 42], ["beer_id", 6], ["created_at", "2018-09-11 16:49:29.854442"], ["updated_at", "2018-09-11 16:49:29.854442"]]
---
  def create
    @rating = Rating.create params.require(:rating).permit(:score, :beer_id)

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 15]]
---
  def destroy
    rating = Rating.find(params[:id])
    rating.delete if current_user == rating.user