app/models/beer.rb

  def self.top_rated(amount)
    all.sort_by{ |b| -(b.average_rating || 0) }.first(amount)
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]